🚀&nbsp; env0 had composed a PR Plan for environment [guaranteedrate-test / multi-provider / env0-multiple-provider-demo ](https://app.env0.com/p/2f38cba0-849b-437e-a4bb-fa7aef27f609/environments/c8f18034-ce9b-4671-a58c-6a9dcf0eff03?organizationId=0a04c922-06fe-4304-b69b-a6acef1cb47d):
```
Plan: 4 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:


  # aws_s3_bucket.test_bucket will be created
+   resource "aws_s3_bucket" "test_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.test_bucket_nonprod will be created
+   resource "aws_s3_bucket" "test_bucket_nonprod" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # random_integer.test_bucket will be created
+   resource "random_integer" "test_bucket" {
+       id     = (known after apply)
+       max    = 9999
+       min    = 1000
+       result = (known after apply)
    }

  # module.tagging.random_uuid.stack_id will be created
+   resource "random_uuid" "stack_id" {
+       id     = (known after apply)
+       result = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/2f38cba0-849b-437e-a4bb-fa7aef27f609/environments/c8f18034-ce9b-4671-a58c-6a9dcf0eff03/deployments/222cfa4d-7325-4ec0-adeb-d5c6d2e6a96b?organizationId=0a04c922-06fe-4304-b69b-a6acef1cb47d)

[Get instant insights with AI Summary](https://app.env0.com/p/2f38cba0-849b-437e-a4bb-fa7aef27f609/environments/c8f18034-ce9b-4671-a58c-6a9dcf0eff03/deployments/222cfa4d-7325-4ec0-adeb-d5c6d2e6a96b?organizationId=0a04c922-06fe-4304-b69b-a6acef1cb47d&ai-analyzer=plan-summary)